Revit 2027 API
BuiltInFailures.ElectricityFailures.InvalidPoleNumberInIsolatedPanel Property
 The panel is an isolated panel. The number of poles should equal to [value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidPoleNumberInIsolatedPanel { get; }
Public Shared ReadOnly Property InvalidPoleNumberInIsolatedPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidPoleNumberInIsolatedPanel {
	FailureDefinitionId^ get ();
}
static member InvalidPoleNumberInIsolatedPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricityFailures Class
Autodesk.Revit.DB Namespace